src/test/resources/artifacts/ESB/config/soapRequests/salesforce/esbDescribeGlobalMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="wso2.connector.salesforce">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:loginUrl>%s(loginUrl)</urn:loginUrl>
        <urn:username>%s(username)</urn:username>
        <urn:password>%s(password)</urn:password>
        <urn:blocking>%s(blocking)</urn:blocking>
        <urn:method>describeGlobal</urn:method>
        <urn:timeout>%s(timeout)</urn:timeout>
    </soapenv:Body>
</soapenv:Envelope>